<?php

return [
    "final_report_attached_status" => [
        "new" => "ارفاق التقارير النهائية",
        "contractor" => "تم ارفاق التقارير النهائية من مقاول",
        "consulting_office" => "تم ارفاق التقارير النهائية من مكتب استشاري",
        "ready" => "تم ارفاق التقارير النهائية",
    ],
    "logs" => [
        "created" => "تم إنشاء الطلب",
        "completed" => "تم إتمام الطلب  من المشرف",
        "approved-all" => "تم اعتماد الطلب من المقاول والمشرف",
        "approved-tsleem" => "تم اعتماد الطلب من مكتب تسليم",
        "rejected-tsleem" => "تم رفض التصاميم من مكتب التسليم",
        "approved-designer" => "تهانينا، تم قبول طلبك من مكتب التصميم",
        "rejected-designer" => "تم رفض الطلب من مكتب التصميم",
        "license-ready" => "الرخصة جاهزة للإصدار",
        "filled" => "تم اختيار المشرف ومكتب المقاولات",
    ],
    "agreement_name" => "تقرير إنهاء ألأعمال",
    "agreed" => "تمت الموافقة على تقرير إنهاء الأعمال",
    "agree" => "أوافق",
    "not_agree" => "غير موافق",
    "agreement_text" => "تم تنفيذ جميع أعمال الإضافات وفقاً للمخططات المعتمدة والرخصة الصادرة من مركز تسليم, وذلك تحت إشرافنا المباشر.\nونؤكد على سلامة التنفيذ وجاهزية المخيم لإستقبال ضيوف الرحمن.",
];
