<?php

return [
    'appointment' => [
        'header_right' => 'شركة كدانة للتنمية والتطوير
مركز تسليم',
        'content' => 'إشارة الى برقية معالي رئيس الديوان الملكي رقم 36674 وتاريخ 13/06/1441هـ المتضمن بالفقرة 2/1/ثانيًا ما مفاده قيام صندوق الاستثمارات العامة بنقل عقود الصيانة والتشغيل والتوريد الخاصة بمخيمات مشعر منى من صندوق الإستثمارات العامة الى شركة كدانة للتنمية والتطوير. فقد تم التنسيق بين شركة كدانة للتنمية والتطوير ووزارة الحج على ان يتم تسليم الجهات المستفيدة من المشروع لمواقعها على الطبيعة من قبل شركة كدانة للتنمية والتطوير.
وان يتم اعادة تلك المواقع وتسليمها شركة كدانة للتنمية والتطويربعد انتهاء موسم الحج بموجب محاضر بهذا الخصوص
وبناءًعليه فقد اجتمعت اللجنة المشاركة من الموقعين ادناه في المذكور اعلاه يوم (&emsp;&emsp;&emsp;) الموافق (&emsp;/&emsp;/1443 هــ) لتسليم الموقع للجهة المستفيدة ولذلك للاستفادة منه في موسم حج عام (1443هـ) وفقا للشروط والالتزامات والتعهدات المذكورة خلف هذه الصفحة والتي التزمت بها الجهة المستفيدة
وبناء عليه يقر مندوب الجهة المستفيدة ويوقع على انه بعد معاينة الموقع تبين ان جميع مكونات وعناصر المخيم بالموقع مكتملة وسليمة فيها
عدا الملاحظات الواردة بالكشوفات المرفقة التالية ارقامها'
    ],
];
