@extends('CP.master')
@section('title')
    الاحصائيات
@endsection
@section('style')
    <link href="{{url('/')}}/assets/index_files/all.min.css" rel="stylesheet">
    <!-- plugin css -->
    <link href="{{url('/')}}/assets/index_files/jquery-jvectormap-1.2.2.css" rel="stylesheet" type="text/css">

    <!-- preloader css -->
    <link rel="stylesheet" href="{{url('/')}}/assets/index_files/preloader.min.css" type="text/css">
    <link rel="stylesheet" href="{{url('/')}}/assets/index_files/custom-panel.css" type="text/css">

    <!-- Bootstrap Css -->
    <link href="{{url('/')}}/assets/index_files/bootstrap-rtl.min.css" id="bootstrap-style" rel="stylesheet"
          type="text/css">
    <!-- Icons Css -->
    <link href="{{url('/')}}/assets/index_files/icons.min.css" rel="stylesheet" type="text/css">
    <!-- App Css-->
    <link href="{{url('/')}}/assets/index_files/app-rtl-3.min.css" id="app-style" rel="stylesheet" type="text/css">
    <link href="{{url('/')}}/assets/index_files/fileinput.min.css" rel="stylesheet" type="text/css">
    <link href="{{url('/')}}/assets/index_files/alertify.min.css" rel="stylesheet" type="text/css">

    <!-- alertifyjs default themes  Css -->
    <link href="{{url('/')}}/assets/index_files/default.min.css" rel="stylesheet" type="text/css">

    <script src="{{url('/')}}/assets/index_files/sweetalert2.all.min.js.download"></script>
    <link rel="stylesheet" href="{{url('/')}}/assets/deshboard/style.css">
    <style>
        .modal-backdrop.show {
            display: initial !important;
        }

        .modal-backdrop.fade {
            display: initial !important;
        }

        .file-view-wrapper:hover {
            box-shadow: var(--bs-box-shadow) !important;
        }

        .file-view-icon {
            height: 180px;
            background-size: 50%;
            background-position: center;
            background-repeat: no-repeat;
        }

        .file-view-wrapper {
            position: relative;
        }

        .file-view-download {
            position: absolute;
            top: 9px;
            left: 11px;
            font-size: 18px;
            color: #0b2473;
        }
        .apexcharts-legend.apx-legend-position-bottom.apexcharts-align-center, .apexcharts-legend.apx-legend-position-top.apexcharts-align-center {
            justify-content: flex-start !important;
        }
        .apexcharts-legend-marker {
            margin-left: 3px !important;
        }
        .apexcharts-tooltip-marker {
            margin-left: 10px !important;
        }
        .apexcharts-tooltip-text-y-value, .apexcharts-tooltip-text-goals-value, .apexcharts-tooltip-text-z-value {
            margin-right: 5px !important;
        }

        .apexcharts-tooltip {
            direction: rtl !important;
        }
        .card-chart-title{
            font-size: 25px;
            font-weight: bold;
        }
    </style>
@endsection
@section('content')
    <div class="row justify-content-center">
        <div class="row justify-content-center">
        {{--<div class="col-xl col-md-6">
                <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--blue">
                    <div class="card-body px-2">
                        <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="32px"
                             height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32" id="_x3C_Layer_x3E_"
                             version="1.1" xml:space="preserve"><g id="clipboard">
                                <g>
                                    <g>
                                        <g>
                                            <path
                                                d="M26.5,3h-5.958v1H26.5C26.776,4,27,4.225,27,4.5v25c0,0.275-0.224,0.5-0.5,0.5h-21      C5.224,30,5,29.775,5,29.5v-25C5,4.225,5.224,4,5.5,4h6V3h-6C4.673,3,4,3.673,4,4.5v25C4,30.327,4.673,31,5.5,31h21      c0.827,0,1.5-0.673,1.5-1.5v-25C28,3.673,27.327,3,26.5,3z"
                                                fill="currentColor"/>
                                        </g>
                                    </g>
                                    <g>
                                        <path
                                            d="M25.5,22c-0.276,0-0.5-0.224-0.5-0.5V6h-2.5C22.224,6,22,5.776,22,5.5S22.224,5,22.5,5h3     C25.776,5,26,5.224,26,5.5v16C26,21.776,25.776,22,25.5,22z"
                                            fill="currentColor"/>
                                    </g>
                                    <g>
                                        <path
                                            d="M20.5,29h-14C6.224,29,6,28.776,6,28.5v-23C6,5.224,6.224,5,6.5,5h3C9.776,5,10,5.224,10,5.5     S9.776,6,9.5,6H7v22h13.5c0.276,0,0.5,0.224,0.5,0.5S20.776,29,20.5,29z"
                                            fill="currentColor"/>
                                    </g>
                                    <g>
                                        <path
                                            d="M20.5,29c-0.064,0-0.129-0.013-0.191-0.038C20.122,28.885,20,28.702,20,28.5v-5     c0-0.276,0.224-0.5,0.5-0.5h5c0.202,0,0.385,0.122,0.462,0.309c0.078,0.187,0.035,0.402-0.108,0.545l-5,5     C20.758,28.949,20.63,29,20.5,29z M21,24v3.293L24.293,24H21z"
                                            fill="currentColor"/>
                                    </g>
                                    <g id="customer_survey_questionnaire_2_">
                                        <g>
                                            <g>
                                                <path
                                                    d="M9.653,18.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,17.959,9.791,18.016,9.653,18.016z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M9.653,13.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,12.959,9.791,13.016,9.653,13.016z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M17.5,23h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,23,17.5,23z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M22.5,21h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,21,22.5,21z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M22.5,16h-3c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h3c0.276,0,0.5,0.224,0.5,0.5       S22.776,16,22.5,16z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M20.5,18h-7c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h7c0.276,0,0.5,0.224,0.5,0.5       S20.776,18,20.5,18z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M17.5,16h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,16,17.5,16z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M22.5,11h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,11,22.5,11z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M18.5,13h-5c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h5c0.276,0,0.5,0.224,0.5,0.5       S18.776,13,18.5,13z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M10.5,23h-2C8.224,23,8,22.776,8,22.5v-2C8,20.224,8.224,20,8.5,20h2c0.276,0,0.5,0.224,0.5,0.5v2       C11,22.776,10.776,23,10.5,23z M9,22h1v-1H9V22z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                    </g>
                                </g>
                                <g>
                                    <path
                                        d="M20.5,7h-9C11.224,7,11,6.776,11,6.5v-3C11,2.673,11.673,2,12.5,2C12.776,2,13,2.224,13,2.5    S12.776,3,12.5,3C12.224,3,12,3.225,12,3.5V6h8V3.5C20,3.225,19.776,3,19.5,3C19.224,3,19,2.776,19,2.5S19.224,2,19.5,2    C20.327,2,21,2.673,21,3.5v3C21,6.776,20.776,7,20.5,7z"
                                        fill="currentColor"/>
                                </g>
                                <g>
                                    <path
                                        d="M17.5,3C17.224,3,17,2.776,17,2.5C17,2.225,16.776,2,16.5,2h-1c-0.108,0-0.211,0.033-0.296,0.097    C15.074,2.192,15,2.339,15,2.5C15,2.776,14.776,3,14.5,3S14,2.776,14,2.5c0-0.475,0.228-0.926,0.609-1.207    C14.867,1.102,15.176,1,15.5,1h1C17.327,1,18,1.673,18,2.5C18,2.776,17.776,3,17.5,3z"
                                        fill="currentColor"/>
                                </g>
                            </g></svg>
                        <h3>عدد الطلبات الكلي</h3>
                        <p> {{$countOrders}} طلب </p>
                        <a href="{{route('orders')}}">عرض الطلبات</a>
                    </div>
                </div>
            </div>--}}

            <div class="col-xl col-md-6">
                <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--blue">
                    <div class="card-body px-2">
                        <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="32px"
                             height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32" id="_x3C_Layer_x3E_"
                             version="1.1" xml:space="preserve"><g id="clipboard">
                                <g>
                                    <g>
                                        <g>
                                            <path
                                                d="M26.5,3h-5.958v1H26.5C26.776,4,27,4.225,27,4.5v25c0,0.275-0.224,0.5-0.5,0.5h-21      C5.224,30,5,29.775,5,29.5v-25C5,4.225,5.224,4,5.5,4h6V3h-6C4.673,3,4,3.673,4,4.5v25C4,30.327,4.673,31,5.5,31h21      c0.827,0,1.5-0.673,1.5-1.5v-25C28,3.673,27.327,3,26.5,3z"
                                                fill="currentColor"/>
                                        </g>
                                    </g>
                                    <g>
                                        <path
                                            d="M25.5,22c-0.276,0-0.5-0.224-0.5-0.5V6h-2.5C22.224,6,22,5.776,22,5.5S22.224,5,22.5,5h3     C25.776,5,26,5.224,26,5.5v16C26,21.776,25.776,22,25.5,22z"
                                            fill="currentColor"/>
                                    </g>
                                    <g>
                                        <path
                                            d="M20.5,29h-14C6.224,29,6,28.776,6,28.5v-23C6,5.224,6.224,5,6.5,5h3C9.776,5,10,5.224,10,5.5     S9.776,6,9.5,6H7v22h13.5c0.276,0,0.5,0.224,0.5,0.5S20.776,29,20.5,29z"
                                            fill="currentColor"/>
                                    </g>
                                    <g>
                                        <path
                                            d="M20.5,29c-0.064,0-0.129-0.013-0.191-0.038C20.122,28.885,20,28.702,20,28.5v-5     c0-0.276,0.224-0.5,0.5-0.5h5c0.202,0,0.385,0.122,0.462,0.309c0.078,0.187,0.035,0.402-0.108,0.545l-5,5     C20.758,28.949,20.63,29,20.5,29z M21,24v3.293L24.293,24H21z"
                                            fill="currentColor"/>
                                    </g>
                                    <g id="customer_survey_questionnaire_2_">
                                        <g>
                                            <g>
                                                <path
                                                    d="M9.653,18.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,17.959,9.791,18.016,9.653,18.016z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M9.653,13.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,12.959,9.791,13.016,9.653,13.016z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M17.5,23h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,23,17.5,23z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M22.5,21h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,21,22.5,21z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M22.5,16h-3c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h3c0.276,0,0.5,0.224,0.5,0.5       S22.776,16,22.5,16z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M20.5,18h-7c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h7c0.276,0,0.5,0.224,0.5,0.5       S20.776,18,20.5,18z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M17.5,16h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,16,17.5,16z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M22.5,11h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,11,22.5,11z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M18.5,13h-5c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h5c0.276,0,0.5,0.224,0.5,0.5       S18.776,13,18.5,13z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M10.5,23h-2C8.224,23,8,22.776,8,22.5v-2C8,20.224,8.224,20,8.5,20h2c0.276,0,0.5,0.224,0.5,0.5v2       C11,22.776,10.776,23,10.5,23z M9,22h1v-1H9V22z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                    </g>
                                </g>
                                <g>
                                    <path
                                        d="M20.5,7h-9C11.224,7,11,6.776,11,6.5v-3C11,2.673,11.673,2,12.5,2C12.776,2,13,2.224,13,2.5    S12.776,3,12.5,3C12.224,3,12,3.225,12,3.5V6h8V3.5C20,3.225,19.776,3,19.5,3C19.224,3,19,2.776,19,2.5S19.224,2,19.5,2    C20.327,2,21,2.673,21,3.5v3C21,6.776,20.776,7,20.5,7z"
                                        fill="currentColor"/>
                                </g>
                                <g>
                                    <path
                                        d="M17.5,3C17.224,3,17,2.776,17,2.5C17,2.225,16.776,2,16.5,2h-1c-0.108,0-0.211,0.033-0.296,0.097    C15.074,2.192,15,2.339,15,2.5C15,2.776,14.776,3,14.5,3S14,2.776,14,2.5c0-0.475,0.228-0.926,0.609-1.207    C14.867,1.102,15.176,1,15.5,1h1C17.327,1,18,1.673,18,2.5C18,2.776,17.776,3,17.5,3z"
                                        fill="currentColor"/>
                                </g>
                            </g></svg>
                        <h3>الطلبات لدى المكاتب الهندسية</h3>
                        <p> {{$order_count_per_designer}} طلب </p>
                        <a href="{{route('orders')}}?params=designe_office_orders">عرض الطلبات</a>
                    </div>
                </div>
            </div>

            <div class="col-xl col-md-6">
                <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--blue">
                    <div class="card-body px-2">
                        <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="32px"
                             height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32" id="_x3C_Layer_x3E_"
                             version="1.1" xml:space="preserve"><g id="clipboard">
                                <g>
                                    <g>
                                        <g>
                                            <path
                                                d="M26.5,3h-5.958v1H26.5C26.776,4,27,4.225,27,4.5v25c0,0.275-0.224,0.5-0.5,0.5h-21      C5.224,30,5,29.775,5,29.5v-25C5,4.225,5.224,4,5.5,4h6V3h-6C4.673,3,4,3.673,4,4.5v25C4,30.327,4.673,31,5.5,31h21      c0.827,0,1.5-0.673,1.5-1.5v-25C28,3.673,27.327,3,26.5,3z"
                                                fill="currentColor"/>
                                        </g>
                                    </g>
                                    <g>
                                        <path
                                            d="M25.5,22c-0.276,0-0.5-0.224-0.5-0.5V6h-2.5C22.224,6,22,5.776,22,5.5S22.224,5,22.5,5h3     C25.776,5,26,5.224,26,5.5v16C26,21.776,25.776,22,25.5,22z"
                                            fill="currentColor"/>
                                    </g>
                                    <g>
                                        <path
                                            d="M20.5,29h-14C6.224,29,6,28.776,6,28.5v-23C6,5.224,6.224,5,6.5,5h3C9.776,5,10,5.224,10,5.5     S9.776,6,9.5,6H7v22h13.5c0.276,0,0.5,0.224,0.5,0.5S20.776,29,20.5,29z"
                                            fill="currentColor"/>
                                    </g>
                                    <g>
                                        <path
                                            d="M20.5,29c-0.064,0-0.129-0.013-0.191-0.038C20.122,28.885,20,28.702,20,28.5v-5     c0-0.276,0.224-0.5,0.5-0.5h5c0.202,0,0.385,0.122,0.462,0.309c0.078,0.187,0.035,0.402-0.108,0.545l-5,5     C20.758,28.949,20.63,29,20.5,29z M21,24v3.293L24.293,24H21z"
                                            fill="currentColor"/>
                                    </g>
                                    <g id="customer_survey_questionnaire_2_">
                                        <g>
                                            <g>
                                                <path
                                                    d="M9.653,18.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,17.959,9.791,18.016,9.653,18.016z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M9.653,13.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,12.959,9.791,13.016,9.653,13.016z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M17.5,23h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,23,17.5,23z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M22.5,21h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,21,22.5,21z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M22.5,16h-3c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h3c0.276,0,0.5,0.224,0.5,0.5       S22.776,16,22.5,16z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M20.5,18h-7c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h7c0.276,0,0.5,0.224,0.5,0.5       S20.776,18,20.5,18z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M17.5,16h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,16,17.5,16z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M22.5,11h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,11,22.5,11z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M18.5,13h-5c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h5c0.276,0,0.5,0.224,0.5,0.5       S18.776,13,18.5,13z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M10.5,23h-2C8.224,23,8,22.776,8,22.5v-2C8,20.224,8.224,20,8.5,20h2c0.276,0,0.5,0.224,0.5,0.5v2       C11,22.776,10.776,23,10.5,23z M9,22h1v-1H9V22z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                    </g>
                                </g>
                                <g>
                                    <path
                                        d="M20.5,7h-9C11.224,7,11,6.776,11,6.5v-3C11,2.673,11.673,2,12.5,2C12.776,2,13,2.224,13,2.5    S12.776,3,12.5,3C12.224,3,12,3.225,12,3.5V6h8V3.5C20,3.225,19.776,3,19.5,3C19.224,3,19,2.776,19,2.5S19.224,2,19.5,2    C20.327,2,21,2.673,21,3.5v3C21,6.776,20.776,7,20.5,7z"
                                        fill="currentColor"/>
                                </g>
                                <g>
                                    <path
                                        d="M17.5,3C17.224,3,17,2.776,17,2.5C17,2.225,16.776,2,16.5,2h-1c-0.108,0-0.211,0.033-0.296,0.097    C15.074,2.192,15,2.339,15,2.5C15,2.776,14.776,3,14.5,3S14,2.776,14,2.5c0-0.475,0.228-0.926,0.609-1.207    C14.867,1.102,15.176,1,15.5,1h1C17.327,1,18,1.673,18,2.5C18,2.776,17.776,3,17.5,3z"
                                        fill="currentColor"/>
                                </g>
                            </g></svg>
                        <h3>الطلبات لدى مكتب تسليم</h3>
                        <p> {{$order_count_per_taslem}} طلب </p>
                        <a href="{{route('orders')}}?params=tasleem">عرض الطلبات</a>
                    </div>
                </div>
            </div>

            <div class="col-xl col-md-6">
                <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--blue">
                    <div class="card-body px-2">
                        <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="32px"
                             height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32" id="Layer_1"
                             version="1.1" xml:space="preserve"><g id="communication">
                                <path
                                    d="M21.504,17c-0.056,0-0.112-0.01-0.167-0.029c-0.2-0.07-0.333-0.259-0.333-0.471V13h-5   c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h5.5c0.276,0,0.5,0.224,0.5,0.5v2.592l2.362-2.907   C24.461,12.067,24.604,12,24.754,12h4.75c0.275,0,0.5-0.225,0.5-0.5v-9c0-0.275-0.225-0.5-0.5-0.5h-25c-0.275,0-0.5,0.225-0.5,0.5   v9c0,0.275,0.225,0.5,0.5,0.5h1.5c0.276,0,0.5,0.224,0.5,0.5S6.28,13,6.004,13h-1.5c-0.827,0-1.5-0.673-1.5-1.5v-9   c0-0.827,0.673-1.5,1.5-1.5h25c0.827,0,1.5,0.673,1.5,1.5v9c0,0.827-0.673,1.5-1.5,1.5h-4.512l-3.101,3.815   C21.795,16.935,21.651,17,21.504,17z"
                                    fill="currentColor"/>
                                <g>
                                    <g>
                                        <path
                                            d="M18.644,17.674l-4.762-1.652l-0.295-2.355c-0.239,0.106-0.516,0.168-0.833,0.168     c-0.056,0-0.103-0.012-0.155-0.016l0.329,2.635c0.023,0.189,0.152,0.349,0.332,0.41l5.055,1.756     c0.9,0.314,1.689,1.427,1.689,2.381v4.493c0,0.276,0.224,0.5,0.5,0.5s0.5-0.224,0.5-0.5V21     C21.004,19.621,19.945,18.129,18.644,17.674z"
                                            fill="currentColor"/>
                                    </g>
                                    <g>
                                        <path
                                            d="M1.504,25.993c-0.276,0-0.5-0.224-0.5-0.5V21c0-1.379,1.059-2.871,2.359-3.326l4.762-1.641l0.063-0.512     c0.034-0.274,0.289-0.465,0.559-0.434c0.273,0.034,0.468,0.284,0.434,0.559l-0.103,0.82c-0.023,0.189-0.153,0.348-0.333,0.41     l-5.054,1.742C2.793,18.934,2.004,20.047,2.004,21v4.493C2.004,25.77,1.78,25.993,1.504,25.993z"
                                            fill="currentColor"/>
                                    </g>
                                    <g>
                                        <path
                                            d="M11.004,30.961c-0.083,0-0.167-0.021-0.242-0.063l-6.5-3.591c-0.16-0.089-0.259-0.257-0.258-0.44     l0.019-3.346c0.002-0.275,0.229-0.543,0.503-0.496c0.276,0.001,0.499,0.227,0.497,0.502l-0.017,3.049l6.007,3.319l5.991-3.06     v-3.313c0-0.276,0.224-0.5,0.5-0.5s0.5,0.224,0.5,0.5v3.619c0,0.188-0.105,0.36-0.272,0.445l-6.5,3.319     C11.16,30.943,11.082,30.961,11.004,30.961z"
                                            fill="currentColor"/>
                                    </g>
                                    <g>
                                        <g>
                                            <path
                                                d="M11.004,7c-0.943,0-1.68-0.172-2.131-0.317C8.609,6.598,8.465,6.316,8.549,6.054      C8.634,5.791,8.914,5.647,9.178,5.73C9.562,5.854,10.189,6,11.004,6c1.808,0,2.774-0.446,2.784-0.451      c0.248-0.115,0.547-0.014,0.666,0.236c0.118,0.248,0.016,0.545-0.232,0.664C14.176,6.473,13.063,7,11.004,7z"
                                                fill="currentColor"/>
                                        </g>
                                        <g>
                                            <path
                                                d="M11.004,15c-2.779,0-4.192-2.344-4.201-6.969C6.801,6.857,6.926,5.168,8.029,4.063      C8.733,3.357,9.733,3,11.004,3s2.271,0.357,2.975,1.063c1.104,1.105,1.229,2.795,1.227,3.969C15.196,12.656,13.783,15,11.004,15      z M11.004,4c-1.009,0-1.75,0.252-2.267,0.769C8.105,5.401,7.8,6.469,7.803,8.029C7.811,12.047,8.857,14,11.004,14      s3.193-1.953,3.201-5.971c0.003-1.561-0.303-2.628-0.935-3.261C12.754,4.252,12.013,4,11.004,4z"
                                                fill="currentColor"/>
                                        </g>
                                    </g>
                                </g>
                                <path
                                    d="M22.504,9h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5S22.78,9,22.504,9z   "
                                    fill="currentColor"/>
                                <path
                                    d="M27.504,6h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5S27.78,6,27.504,6z   "
                                    fill="currentColor"/>
                            </g></svg>
                        <h3>عدد رخص الاضافات الصادرة</h3>
                        <p>{{$license_number}} رخصة </p>
                        <a href="{{route('licenses')}}">عرض الرخص</a>
                    </div>
                </div>
            </div>
            {{--Todo: Don't remove this. 2022/06/22 --}}
            {{--<div class="col-xl-3 col-md-6">
                <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--blue">
                    <div class="card-body px-2">
                        <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="32px" height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32" id="_x3C_Layer_x3E_" version="1.1" xml:space="preserve"><g id="folder"><g><path d="M29.5,7h-18c-0.167,0-0.323-0.084-0.416-0.223L9.639,4.609C9.426,4.29,8.884,4,8.5,4h-5    C3.224,4,3,4.225,3,4.5v2C3,6.776,2.776,7,2.5,7S2,6.776,2,6.5v-2C2,3.673,2.673,3,3.5,3h5c0.723,0,1.571,0.453,1.971,1.055    L11.768,6H29.5C29.776,6,30,6.224,30,6.5S29.776,7,29.5,7z" fill="currentColor"/></g><g><g><path d="M29.5,30h-27C1.673,30,1,29.327,1,28.5v-19C1,8.673,1.673,8,2.5,8h27C30.327,8,31,8.673,31,9.5v19     C31,29.327,30.327,30,29.5,30z M2.5,9C2.224,9,2,9.225,2,9.5v19C2,28.775,2.224,29,2.5,29h27c0.276,0,0.5-0.225,0.5-0.5v-19     C30,9.225,29.776,9,29.5,9H2.5z" fill="currentColor"/></g></g><g><g><path d="M25.5,28h-24C1.224,28,1,27.776,1,27.5S1.224,27,1.5,27h24c0.276,0,0.5,0.224,0.5,0.5S25.776,28,25.5,28z     " fill="currentColor"/></g></g><g><g><path d="M13.5,13h-9C4.224,13,4,12.776,4,12.5S4.224,12,4.5,12h9c0.276,0,0.5,0.224,0.5,0.5S13.776,13,13.5,13z" fill="currentColor"/></g></g><g><g><path d="M9.5,15h-5C4.224,15,4,14.776,4,14.5S4.224,14,4.5,14h5c0.276,0,0.5,0.224,0.5,0.5S9.776,15,9.5,15z" fill="currentColor"/></g></g><g><circle cx="27.5" cy="27.5" fill="currentColor" r="0.5"/></g></g></svg>
                        <h3>المخيمات تحت التنفيد</h3>
                        <p>{{$not_complete_orders}}  مخيم </p>
                        <a href="#">عرض المخيمات</a>
                    </div>
                </div>
            </div>--}}


        </div>
        <div class="row justify-content-center">
            <div class="col-xl col-md-6">
            <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--brown">
                            <div class="card-body px-2">
                                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
                                     width="32px"
                                     height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32"
                                     id="_x3C_Layer_x3E_"
                                     version="1.1" xml:space="preserve"><g id="folder">
                                        <g>
                                            <path
                                                d="M29.5,7h-18c-0.167,0-0.323-0.084-0.416-0.223L9.639,4.609C9.426,4.29,8.884,4,8.5,4h-5    C3.224,4,3,4.225,3,4.5v2C3,6.776,2.776,7,2.5,7S2,6.776,2,6.5v-2C2,3.673,2.673,3,3.5,3h5c0.723,0,1.571,0.453,1.971,1.055    L11.768,6H29.5C29.776,6,30,6.224,30,6.5S29.776,7,29.5,7z"
                                                fill="currentColor"/>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M29.5,30h-27C1.673,30,1,29.327,1,28.5v-19C1,8.673,1.673,8,2.5,8h27C30.327,8,31,8.673,31,9.5v19     C31,29.327,30.327,30,29.5,30z M2.5,9C2.224,9,2,9.225,2,9.5v19C2,28.775,2.224,29,2.5,29h27c0.276,0,0.5-0.225,0.5-0.5v-19     C30,9.225,29.776,9,29.5,9H2.5z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M25.5,28h-24C1.224,28,1,27.776,1,27.5S1.224,27,1.5,27h24c0.276,0,0.5,0.224,0.5,0.5S25.776,28,25.5,28z     "
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M13.5,13h-9C4.224,13,4,12.776,4,12.5S4.224,12,4.5,12h9c0.276,0,0.5,0.224,0.5,0.5S13.776,13,13.5,13z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M9.5,15h-5C4.224,15,4,14.776,4,14.5S4.224,14,4.5,14h5c0.276,0,0.5,0.224,0.5,0.5S9.776,15,9.5,15z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <circle cx="27.5" cy="27.5" fill="currentColor" r="0.5"/>
                                        </g>
                                    </g></svg>
                                <h3>عدد شركات حجاج الداخل </h3>
                                <p>{{$donat['number_of_service_providers_in']}} شركة </p>
                                <a href="{{route('users',['params' => 'raft_in', 'type' => 'service_provider'])}}">عرض الشركات</a>
                            </div>
                        </div>
            </div>
            <div class="col-xl col-md-6">
            <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--lighbrown">
                            <div class="card-body px-2">
                                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
                                     width="32px"
                                     height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32"
                                     id="_x3C_Layer_x3E_"
                                     version="1.1" xml:space="preserve"><g id="clipboard">
                                        <g>
                                            <g>
                                                <g>
                                                    <path
                                                        d="M26.5,3h-5.958v1H26.5C26.776,4,27,4.225,27,4.5v25c0,0.275-0.224,0.5-0.5,0.5h-21      C5.224,30,5,29.775,5,29.5v-25C5,4.225,5.224,4,5.5,4h6V3h-6C4.673,3,4,3.673,4,4.5v25C4,30.327,4.673,31,5.5,31h21      c0.827,0,1.5-0.673,1.5-1.5v-25C28,3.673,27.327,3,26.5,3z"
                                                        fill="currentColor"/>
                                                </g>
                                            </g>
                                            <g>
                                                <path
                                                    d="M25.5,22c-0.276,0-0.5-0.224-0.5-0.5V6h-2.5C22.224,6,22,5.776,22,5.5S22.224,5,22.5,5h3     C25.776,5,26,5.224,26,5.5v16C26,21.776,25.776,22,25.5,22z"
                                                    fill="currentColor"/>
                                            </g>
                                            <g>
                                                <path
                                                    d="M20.5,29h-14C6.224,29,6,28.776,6,28.5v-23C6,5.224,6.224,5,6.5,5h3C9.776,5,10,5.224,10,5.5     S9.776,6,9.5,6H7v22h13.5c0.276,0,0.5,0.224,0.5,0.5S20.776,29,20.5,29z"
                                                    fill="currentColor"/>
                                            </g>
                                            <g>
                                                <path
                                                    d="M20.5,29c-0.064,0-0.129-0.013-0.191-0.038C20.122,28.885,20,28.702,20,28.5v-5     c0-0.276,0.224-0.5,0.5-0.5h5c0.202,0,0.385,0.122,0.462,0.309c0.078,0.187,0.035,0.402-0.108,0.545l-5,5     C20.758,28.949,20.63,29,20.5,29z M21,24v3.293L24.293,24H21z"
                                                    fill="currentColor"/>
                                            </g>
                                            <g id="customer_survey_questionnaire_2_">
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M9.653,18.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,17.959,9.791,18.016,9.653,18.016z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M9.653,13.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,12.959,9.791,13.016,9.653,13.016z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M17.5,23h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,23,17.5,23z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M22.5,21h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,21,22.5,21z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M22.5,16h-3c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h3c0.276,0,0.5,0.224,0.5,0.5       S22.776,16,22.5,16z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M20.5,18h-7c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h7c0.276,0,0.5,0.224,0.5,0.5       S20.776,18,20.5,18z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M17.5,16h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,16,17.5,16z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M22.5,11h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,11,22.5,11z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M18.5,13h-5c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h5c0.276,0,0.5,0.224,0.5,0.5       S18.776,13,18.5,13z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M10.5,23h-2C8.224,23,8,22.776,8,22.5v-2C8,20.224,8.224,20,8.5,20h2c0.276,0,0.5,0.224,0.5,0.5v2       C11,22.776,10.776,23,10.5,23z M9,22h1v-1H9V22z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                            </g>
                                        </g>
                                        <g>
                                            <path
                                                d="M20.5,7h-9C11.224,7,11,6.776,11,6.5v-3C11,2.673,11.673,2,12.5,2C12.776,2,13,2.224,13,2.5    S12.776,3,12.5,3C12.224,3,12,3.225,12,3.5V6h8V3.5C20,3.225,19.776,3,19.5,3C19.224,3,19,2.776,19,2.5S19.224,2,19.5,2    C20.327,2,21,2.673,21,3.5v3C21,6.776,20.776,7,20.5,7z"
                                                fill="currentColor"/>
                                        </g>
                                        <g>
                                            <path
                                                d="M17.5,3C17.224,3,17,2.776,17,2.5C17,2.225,16.776,2,16.5,2h-1c-0.108,0-0.211,0.033-0.296,0.097    C15.074,2.192,15,2.339,15,2.5C15,2.776,14.776,3,14.5,3S14,2.776,14,2.5c0-0.475,0.228-0.926,0.609-1.207    C14.867,1.102,15.176,1,15.5,1h1C17.327,1,18,1.673,18,2.5C18,2.776,17.776,3,17.5,3z"
                                                fill="currentColor"/>
                                        </g>
                                    </g></svg>
                                <h3>عدد شركات حجاج الخارج</h3>
                                <p> {{$donat['number_of_service_providers_out']}} شركة </p>
                                <a href="{{route('users',['params' => 'raft_out', 'type' => 'raft_center'])}}">عرض الشركات</a>
                            </div>
                        </div>
            </div>
            <div class="col-xl col-md-6">
            <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--lighbrown">
                            <div class="card-body px-2">
                                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
                                     width="32px"
                                     height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32"
                                     id="_x3C_Layer_x3E_"
                                     version="1.1" xml:space="preserve"><g id="folder">
                                        <g>
                                            <path
                                                d="M29.5,7h-18c-0.167,0-0.323-0.084-0.416-0.223L9.639,4.609C9.426,4.29,8.884,4,8.5,4h-5    C3.224,4,3,4.225,3,4.5v2C3,6.776,2.776,7,2.5,7S2,6.776,2,6.5v-2C2,3.673,2.673,3,3.5,3h5c0.723,0,1.571,0.453,1.971,1.055    L11.768,6H29.5C29.776,6,30,6.224,30,6.5S29.776,7,29.5,7z"
                                                fill="currentColor"/>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M29.5,30h-27C1.673,30,1,29.327,1,28.5v-19C1,8.673,1.673,8,2.5,8h27C30.327,8,31,8.673,31,9.5v19     C31,29.327,30.327,30,29.5,30z M2.5,9C2.224,9,2,9.225,2,9.5v19C2,28.775,2.224,29,2.5,29h27c0.276,0,0.5-0.225,0.5-0.5v-19     C30,9.225,29.776,9,29.5,9H2.5z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M25.5,28h-24C1.224,28,1,27.776,1,27.5S1.224,27,1.5,27h24c0.276,0,0.5,0.224,0.5,0.5S25.776,28,25.5,28z     "
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M13.5,13h-9C4.224,13,4,12.776,4,12.5S4.224,12,4.5,12h9c0.276,0,0.5,0.224,0.5,0.5S13.776,13,13.5,13z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M9.5,15h-5C4.224,15,4,14.776,4,14.5S4.224,14,4.5,14h5c0.276,0,0.5,0.224,0.5,0.5S9.776,15,9.5,15z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <circle cx="27.5" cy="27.5" fill="currentColor" r="0.5"/>
                                        </g>
                                    </g></svg>
                                <h3>المكاتب الهندسية المؤهلة</h3>
                                <p>{{$donat['design_office']}} مكتب </p>
                                <a href="{{route('users')}}?params=design_office">عرض المكاتب</a>
                            </div>
                        </div>
            </div>
            <div class="col-xl col-md-6">
            <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--brown">
                            <div class="card-body px-2">
                                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
                                     width="32px"
                                     height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32"
                                     id="_x3C_Layer_x3E_"
                                     version="1.1" xml:space="preserve"><g id="clipboard">
                                        <g>
                                            <g>
                                                <g>
                                                    <path
                                                        d="M26.5,3h-5.958v1H26.5C26.776,4,27,4.225,27,4.5v25c0,0.275-0.224,0.5-0.5,0.5h-21      C5.224,30,5,29.775,5,29.5v-25C5,4.225,5.224,4,5.5,4h6V3h-6C4.673,3,4,3.673,4,4.5v25C4,30.327,4.673,31,5.5,31h21      c0.827,0,1.5-0.673,1.5-1.5v-25C28,3.673,27.327,3,26.5,3z"
                                                        fill="currentColor"/>
                                                </g>
                                            </g>
                                            <g>
                                                <path
                                                    d="M25.5,22c-0.276,0-0.5-0.224-0.5-0.5V6h-2.5C22.224,6,22,5.776,22,5.5S22.224,5,22.5,5h3     C25.776,5,26,5.224,26,5.5v16C26,21.776,25.776,22,25.5,22z"
                                                    fill="currentColor"/>
                                            </g>
                                            <g>
                                                <path
                                                    d="M20.5,29h-14C6.224,29,6,28.776,6,28.5v-23C6,5.224,6.224,5,6.5,5h3C9.776,5,10,5.224,10,5.5     S9.776,6,9.5,6H7v22h13.5c0.276,0,0.5,0.224,0.5,0.5S20.776,29,20.5,29z"
                                                    fill="currentColor"/>
                                            </g>
                                            <g>
                                                <path
                                                    d="M20.5,29c-0.064,0-0.129-0.013-0.191-0.038C20.122,28.885,20,28.702,20,28.5v-5     c0-0.276,0.224-0.5,0.5-0.5h5c0.202,0,0.385,0.122,0.462,0.309c0.078,0.187,0.035,0.402-0.108,0.545l-5,5     C20.758,28.949,20.63,29,20.5,29z M21,24v3.293L24.293,24H21z"
                                                    fill="currentColor"/>
                                            </g>
                                            <g id="customer_survey_questionnaire_2_">
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M9.653,18.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,17.959,9.791,18.016,9.653,18.016z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M9.653,13.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,12.959,9.791,13.016,9.653,13.016z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M17.5,23h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,23,17.5,23z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M22.5,21h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,21,22.5,21z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M22.5,16h-3c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h3c0.276,0,0.5,0.224,0.5,0.5       S22.776,16,22.5,16z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M20.5,18h-7c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h7c0.276,0,0.5,0.224,0.5,0.5       S20.776,18,20.5,18z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M17.5,16h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,16,17.5,16z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M22.5,11h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,11,22.5,11z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M18.5,13h-5c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h5c0.276,0,0.5,0.224,0.5,0.5       S18.776,13,18.5,13z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                                <g>
                                                    <g>
                                                        <path
                                                            d="M10.5,23h-2C8.224,23,8,22.776,8,22.5v-2C8,20.224,8.224,20,8.5,20h2c0.276,0,0.5,0.224,0.5,0.5v2       C11,22.776,10.776,23,10.5,23z M9,22h1v-1H9V22z"
                                                            fill="currentColor"/>
                                                    </g>
                                                </g>
                                            </g>
                                        </g>
                                        <g>
                                            <path
                                                d="M20.5,7h-9C11.224,7,11,6.776,11,6.5v-3C11,2.673,11.673,2,12.5,2C12.776,2,13,2.224,13,2.5    S12.776,3,12.5,3C12.224,3,12,3.225,12,3.5V6h8V3.5C20,3.225,19.776,3,19.5,3C19.224,3,19,2.776,19,2.5S19.224,2,19.5,2    C20.327,2,21,2.673,21,3.5v3C21,6.776,20.776,7,20.5,7z"
                                                fill="currentColor"/>
                                        </g>
                                        <g>
                                            <path
                                                d="M17.5,3C17.224,3,17,2.776,17,2.5C17,2.225,16.776,2,16.5,2h-1c-0.108,0-0.211,0.033-0.296,0.097    C15.074,2.192,15,2.339,15,2.5C15,2.776,14.776,3,14.5,3S14,2.776,14,2.5c0-0.475,0.228-0.926,0.609-1.207    C14.867,1.102,15.176,1,15.5,1h1C17.327,1,18,1.673,18,2.5C18,2.776,17.776,3,17.5,3z"
                                                fill="currentColor"/>
                                        </g>
                                    </g></svg>
                                <h3>عدد المقاولين المؤهلين</h3>
                                <p> {{$donat['number_of_contractors']}} مقاول </p>
                                <a href="{{route('users')}}?params=contractor">عرض المقاولين</a>
                            </div>
                        </div>
            </div>
            <div class="col-xl col-md-6">
            <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--lighbrown">
                            <div class="card-body px-2">
                                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
                                     width="32px"
                                     height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32"
                                     id="_x3C_Layer_x3E_"
                                     version="1.1" xml:space="preserve"><g id="folder">
                                        <g>
                                            <path
                                                d="M29.5,7h-18c-0.167,0-0.323-0.084-0.416-0.223L9.639,4.609C9.426,4.29,8.884,4,8.5,4h-5    C3.224,4,3,4.225,3,4.5v2C3,6.776,2.776,7,2.5,7S2,6.776,2,6.5v-2C2,3.673,2.673,3,3.5,3h5c0.723,0,1.571,0.453,1.971,1.055    L11.768,6H29.5C29.776,6,30,6.224,30,6.5S29.776,7,29.5,7z"
                                                fill="currentColor"/>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M29.5,30h-27C1.673,30,1,29.327,1,28.5v-19C1,8.673,1.673,8,2.5,8h27C30.327,8,31,8.673,31,9.5v19     C31,29.327,30.327,30,29.5,30z M2.5,9C2.224,9,2,9.225,2,9.5v19C2,28.775,2.224,29,2.5,29h27c0.276,0,0.5-0.225,0.5-0.5v-19     C30,9.225,29.776,9,29.5,9H2.5z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M25.5,28h-24C1.224,28,1,27.776,1,27.5S1.224,27,1.5,27h24c0.276,0,0.5,0.224,0.5,0.5S25.776,28,25.5,28z     "
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M13.5,13h-9C4.224,13,4,12.776,4,12.5S4.224,12,4.5,12h9c0.276,0,0.5,0.224,0.5,0.5S13.776,13,13.5,13z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <g>
                                                <path
                                                    d="M9.5,15h-5C4.224,15,4,14.776,4,14.5S4.224,14,4.5,14h5c0.276,0,0.5,0.224,0.5,0.5S9.776,15,9.5,15z"
                                                    fill="currentColor"/>
                                            </g>
                                        </g>
                                        <g>
                                            <circle cx="27.5" cy="27.5" fill="currentColor" r="0.5"/>
                                        </g>
                                    </g></svg>
                                <h3>مقاولي نقل مخلفات الإنشاء</h3>
                                <p> {{$wasteContractors}} مقاول </p>
                                <a href="javascript:;" onclick="showModal('{{route('showWest')}}')">عرض المقاولين</a>

                            </div>
                        </div>
            </div>
        </div>
        <div class="row justify-content-center">
            <div class="col-lg-6">
                <div class="card card-h-100 card-chart">
                    <div class="card-body px-2">
                        <h3 class="custom-stats-title">عدد الطلبات حسب حالتها</h3>
                        <div style="direction: ltr;padding: 0 20px;">
                            <div id="order-by-status" style="min-height: 160px;"></div>
                        </div>
                    </div>
                </div>
            </div>

            <div class="col-xl-6 col-md-12">
                <div class="card card-h-100 card-chart">
                    <div class="card-body px-2">
                        <div class="d-flex align-items-center justify-content-between">
                            <div class="d-flex card-chart-title ps-3">
                                المخيمات التى تم تسليمها
                            </div>
                            <div class="d-flex">
                                <button class="btn btn-primary" id="export-barchart">
                                    <i id="export-barchart-loading" class="d-none fas fa-spinner fa-spin" ></i>
                                    <span>تصدير</span>
                                </button>
                            </div>
                        </div>
                        <div style="direction: ltr">
                            <div id="barchart-1" style="min-height: 350px;"></div>
                        </div>
                    </div>
                </div>
            </div>

        </div>


    </div>
    <div class="modal fade" id="page_modal" tabindex="-1" role="dialog" aria-labelledby="view-user-files-modal-title"
         aria-hidden="true">

    </div>

@endsection

@section('scripts')
    <script src="https://cdn.jsdelivr.net/npm/apexcharts"></script>
    <script>
        var orderStatus = @json($orderStatusChartData['statusList']);
        var barchart2 = {
            chart: {
                events: {
                    dataPointSelection: (event, chartContext, config) => {
                        if(orderStatus[config.dataPointIndex] == {{ \App\Models\Order::PENDING_OPERATION }}){
                            return window.location.href = '{{ route('licenses') }}';
                        }else {
                            return window.location.href = '{{ route('orders') }}?order_status='+orderStatus[config.dataPointIndex]
                        }
    }
    },
                type: 'bar'
            },
            plotOptions: {
                bar: {
                    borderRadius: 4,
                    horizontal: true,
                }
            },
            dataLabels: {
          enabled: true,
          style: {
            fontSize: '14px',
            colors: ['#000']
          }
        },
            colors: ['#d09f7b'],
            series: [{
                name: "عدد الطلبات",
                data: @json($orderStatusChartData['seriesData'])
            }],

            xaxis: {
                labels: {
                    style: {
                        fontSize: '13px'
                    },
                },
                tooltip: {
                    enabled: true,
                    style: {
                        fontSize: '14px',
                        fontFamily: 'JannaLT'
                    },
                 },
                categories: @json($orderStatusChartData['seriesCategories']),
            }
        }
        new ApexCharts(document.querySelector("#order-by-status"), barchart2).render();

        var barchart1 = {
            chart: {
                type: 'bar',
                // height: 350,
            },
            series: [
                {
                    name: "النسبة",
                    data: @json($bar),
                }
            ],
            plotOptions: {
                bar: {
                    distributed: !0,
                    borderRadius: 4,
                    horizontal: !0
                }
            },
            dataLabels: {
                enabled: !0,
                formatter: (val, opts) => `${val}%`,
            },
            // colors: ['#A0522D', '#e5eb34', '#3CB371', '#4169E1', '#A52A2A', '#D3D3D3', '#FFC0CB'],
            colors: ['#4169E1', '#e5eb34', '#A0522D', '#f17a29','#bb0000', 'rgba(20,187,110,0.65)', '#d76e80'],
            tooltip: {
                y: {
                    formatter: (value, { series, seriesIndex, dataPointIndex, w })  => {
                        try{
                            const data = barchart1.series[seriesIndex]?.data[dataPointIndex]
                            return data?.box_count_to_string || value
                        }
                        catch (e) {

                        }
                        return value
                    },
                    title: {
                        formatter: s => 'العدد: ',
                    },
                },
            },
            xaxis: {
                labels: {
                    show: !1,
                },
                tooltip: {
                    enabled: true,
                    offsetX: 60,
                },
            },
            yaxis: {
                // floating: !0,
                // reversed: !0,
                labels: {
                    show: true,
                    // align: 'left',
                    minWidth: 0,
                    maxWidth: 160,
                    style: {
                        colors: [],
                        fontSize: '12px',
                        fontFamily: 'Helvetica, Arial, sans-serif',
                        fontWeight: 400,
                        cssClass: 'apexcharts-yaxis-label',
                    },
                    // offsetX: '-100%',
                    offsetY: 0,
                    rotate: 0,
                    // formatter: (value) => { return 's' },
                },
                tooltip: {
                    enabled: true,
                    // offsetX: -100,
                },
            },
            legend: {
                show: !1,
            },
        }
        new ApexCharts(document.querySelector("#barchart-1"), barchart1).render();

        var chart1 = {
            chart: {
                type: 'area',
                height: 160,
                sparkline: {
                    enabled: true
                },
            },

            stroke: {
                curve: 'straight'
            },
            fill: {
                opacity: 1,
            },
            series: [{
                name: 'المجوع',
                data: @json(array_values($box_with_files_in))
            }],
            labels: @json(array_keys($box_with_files_in)),
            yaxis: {
                min: 0
            },
            xaxis: {
                type: 'datetime',
            },
            colors: ['#0A2373'],
            title: {
                text: '{{$count_box_with_files_in}}',
                offsetX: 0 + '%',
                style: {
                    fontSize: '24px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                }
            },
            subtitle: {
                text: ' المحاضر المسلمة لشركات حجاج الداخل',
                offsetX: 0 + '%',
                style: {
                    fontSize: '14px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                    padding: "0px 20px"
                }
            }
        }
        new ApexCharts(document.querySelector("#chart-1"), chart1).render();

        //


        var chart2 = {
            chart: {
                type: 'area',
                height: 160,
                sparkline: {
                    enabled: true
                },
            },

            stroke: {
                curve: 'straight'
            },
            fill: {
                opacity: 1,
            },
            series: [{
                name: 'المجوع',
                data: @json(array_values($box_with_files_out))
            }],
            labels: @json(array_keys($box_with_files_out)),
            yaxis: {
                min: 0
            },
            xaxis: {
                type: 'datetime',
            },
            colors: ['#0A2373'],
            title: {
                text: @json($count_box_with_files_out),
                offsetX: 0 + '%',
                style: {
                    fontSize: '24px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                }
            },
            subtitle: {
                text: 'المحاضر المسلمة لشركات حجاج الخارج',
                offsetX: 0 + '%',
                style: {
                    fontSize: '14px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                    padding: "0px 20px"
                }
            }
        }
        new ApexCharts(document.querySelector("#chart-2"), chart2).render();


        //


        var chart3 = {
            chart: {
                type: 'area',
                height: 160,
                sparkline: {
                    enabled: true
                },
            },

            stroke: {
                curve: 'straight'
            },
            fill: {
                opacity: 1,
            },
            series: [{
                name: 'المجوع',
                data: @json(array_values($count_actions_performed_per_day))
            }],
            labels:  @json(array_keys($count_actions_performed_per_day)),
            yaxis: {
                min: 0
            },
            xaxis: {
                type: 'datetime',
            },
            colors: ['#0A2373'],
            title: {
                text: @json($count_actions_performed),
                offsetX: 0 + '%',
                style: {
                    fontSize: '24px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                }
            },
            subtitle: {
                text: 'عدد الإجراءات المنفذة',
                offsetX: 0 + '%',
                style: {
                    fontSize: '14px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                    padding: "0px 20px"
                }
            }
        }
        new ApexCharts(document.querySelector("#chart-3"), chart3).render();


        //


        var chart4 = {
            chart: {
                type: 'area',
                height: 160,
                sparkline: {
                    enabled: true
                },
            },

            stroke: {
                curve: 'straight'
            },
            fill: {
                opacity: 1,
            },
            series: [{
                name: 'المجوع',
                data: @json(array_values($session_for_boxes))
            }],
            labels: @json(array_keys($session_for_boxes)),
            yaxis: {
                min: 0
            },
            xaxis: {
                type: 'datetime',
            },
            colors: ['#0A2373'],
            title: {
                text: '{{$session_count}}',
                offsetX: 0 + '%',
                style: {
                    fontSize: '24px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                }
            },
            subtitle: {
                text: 'المواعيد التي تم اطلاقها لإستلام المخيمات',
                offsetX: 0 + '%',
                style: {
                    fontSize: '14px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                    padding: "0px 20px"
                }
            }
        }
        new ApexCharts(document.querySelector("#chart-4"), chart4).render();


        //


        var chart5 = {
            chart: {
                type: 'area',
                height: 160,
                sparkline: {
                    enabled: true
                },
            },

            stroke: {
                curve: 'straight'
            },
            fill: {
                opacity: 1,
            },
            series: [{
                name: 'المجوع',
                data: @json(array_values($number_of_login_per_day))
            }],
            labels: @json(array_keys($number_of_login_per_day)),
            yaxis: {
                min: 0
            },
            xaxis: {
                type: 'datetime',
            },
            colors: ['#0A2373'],
            title: {
                text: '{{$number_of_login}}',
                offsetX: 0 + '%',
                style: {
                    fontSize: '24px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                }
            },
            subtitle: {
                text: 'مرات الدخول الى المنصة',
                offsetX: 0 + '%',
                style: {
                    fontSize: '14px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                    padding: "0px 20px"
                }
            }
        }
        new ApexCharts(document.querySelector("#chart-5"), chart5).render();

        var chart7 = {
            chart: {
                type: 'area',
                height: 160,
                sparkline: {
                    enabled: true
                },
            },

            stroke: {
                curve: 'straight'
            },
            fill: {
                opacity: 1,
            },
            series: [{
                name: 'المجوع',
                data: @json(array_values($count_actions_outing_per_day))
            }],
            labels: @json(array_keys($count_actions_outing_per_day)),
            yaxis: {
                min: 0
            },
            xaxis: {
                type: 'datetime',
            },
            colors: ['#0A2373'],
            title: {
                text: '{{$count_actions_outing}}',
                offsetX: 0 + '%',
                style: {
                    fontSize: '24px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                }
            },
            subtitle: {
                text: 'عدد الطلبات الصادرة',
                offsetX: 0 + '%',
                style: {
                    fontSize: '14px',
                    cssClass: 'apexcharts-yaxis-title px-4',
                    fontFamily: 'JannaLT',
                    padding: "0px 20px"
                }
            }
        }
        new ApexCharts(document.querySelector("#chart-7"), chart7).render();


        //


        var optionDonut = {
            chart: {
                type: 'donut',
                width: '100%',
                height: 250,
            },
            colors: ['#bf9370', '#8e6f50', '#615036', '#745931', '#663e00'],
            legend: {
                fontWeight: 400,
                formatter: function (seriesName, opts) {
                    return '<div class="legend-info">' + '<span class="pe-2">' + seriesName + '</span>' + '<span class="text-dark font-size-18">' + opts.w.globals.series[opts.seriesIndex] + '</span>' + '</div>'
                }
            },
            series: @json(array_values($donat))
            ,
            dataLabels: {
                enabled: false,
            },
            labels: ['شركات الطوافة (حجاج الخارج) المسجلة', 'عدد شركات حجاج الداخل المسجلين', 'عدد المكاتب الهندسية المسجلة', 'عدد المقاولين المسجلين'],

            plotOptions: {
                pie: {
                    donut: {
                        labels: {
                            show: true,
                            name: {
                                show: true,
                                color: '#dfsda',
                                offsetY: -10
                            },
                            value: {
                                show: true,
                                color: undefined,
                                offsetY: 16,
                                formatter: function (val) {
                                    return val
                                }
                            },
                            total: {
                                show: true,
                                label: 'المجموع',
                                color: '#373d3f',
                                formatter: function (w) {
                                    return w.globals.seriesTotals.reduce((a, b) => {
                                        return a + b
                                    }, 0)
                                }
                            }
                        }
                    }
                }
            },
        }

        var donut = new ApexCharts(
            document.querySelector("#chart-6"),
            optionDonut
        )
        donut.render();

        function showModal(url) {
            $.ajax({
                url: url,
                type: 'GET',
                beforeSend() {
                    // KTApp.blockPage({
                    //     overlayColor: '#000000',
                    //     type: 'v2',
                    //     state: 'success',
                    //     message: 'please wait'
                    // });
                },
                success: function (data) {
                    if (data.success) {

                        $('#page_modal').html(data.page).modal('show', {backdrop: 'static', keyboard: false})


                    } else {
                        showAlertMessage('error', '@lang('constants.unknown_error')')
                    }
                },
                error: function (data) {
                    KTApp.unblockPage()
                }
            })
        }

        $('#close').on('click', function () {
            $('#page_modal').modal("hide")
        });

        $('#export-barchart').on('click', function (e) {
            e.preventDefault();
            window.location.href = '{{ route('exportRaftCompanyLocationBar') }}'
            $('#export-barchart-loading').removeClass('d-none');
            window.alertMessage({title: 'جاري تصدير البيانات الرجاء الإنتظار'})
            .then( () => $('#export-barchart-loading').addClass('d-none') )
        });
    </script>
    <div class="hs-dummy-scrollbar-size">
        <div style="height: 200%; width: 200%; margin: 10px 0;"></div>
    </div>
    <svg id="SvgjsSvg1001" width="2" height="0" xmlns="http://www.w3.org/2000/svg" version="1.1"
         xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:svgjs="http://svgjs.com/svgjs"
         style="overflow: hidden; top: -100%; left: -100%; position: absolute; opacity: 0;">
        <defs id="SvgjsDefs1002"></defs>
        <polyline id="SvgjsPolyline1003" points="0,0"></polyline>
        <path id="SvgjsPath1004" d="M0 0 "></path>
    </svg>
    <svg id="SvgjsSvg1418" width="2" height="0" xmlns="http://www.w3.org/2000/svg" version="1.1"
         xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:svgjs="http://svgjs.dev"
         style="overflow: hidden; top: -100%; left: -100%; position: absolute; opacity: 0;">
        <defs id="SvgjsDefs1419"></defs>
        <polyline id="SvgjsPolyline1420" points="0,0"></polyline>
        <path id="SvgjsPath1421"
              d="M-1 69L-1 69L166.66666666666666 69L333.3333333333333 69L500 69C500 69 500 69 500 69 ">
        </path>
    </svg>
@endsection
{{--<div class="col-xl-4 col-md-6">--}}
{{--    <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--blue">--}}
{{--        <div class="card-body px-2">--}}
{{--            <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="32px" height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32" id="_x3C_Layer_x3E_" version="1.1" xml:space="preserve"><g id="clipboard"><g><g><g><path d="M26.5,3h-5.958v1H26.5C26.776,4,27,4.225,27,4.5v25c0,0.275-0.224,0.5-0.5,0.5h-21      C5.224,30,5,29.775,5,29.5v-25C5,4.225,5.224,4,5.5,4h6V3h-6C4.673,3,4,3.673,4,4.5v25C4,30.327,4.673,31,5.5,31h21      c0.827,0,1.5-0.673,1.5-1.5v-25C28,3.673,27.327,3,26.5,3z" fill="currentColor"/></g></g><g><path d="M25.5,22c-0.276,0-0.5-0.224-0.5-0.5V6h-2.5C22.224,6,22,5.776,22,5.5S22.224,5,22.5,5h3     C25.776,5,26,5.224,26,5.5v16C26,21.776,25.776,22,25.5,22z" fill="currentColor"/></g><g><path d="M20.5,29h-14C6.224,29,6,28.776,6,28.5v-23C6,5.224,6.224,5,6.5,5h3C9.776,5,10,5.224,10,5.5     S9.776,6,9.5,6H7v22h13.5c0.276,0,0.5,0.224,0.5,0.5S20.776,29,20.5,29z" fill="currentColor"/></g><g><path d="M20.5,29c-0.064,0-0.129-0.013-0.191-0.038C20.122,28.885,20,28.702,20,28.5v-5     c0-0.276,0.224-0.5,0.5-0.5h5c0.202,0,0.385,0.122,0.462,0.309c0.078,0.187,0.035,0.402-0.108,0.545l-5,5     C20.758,28.949,20.63,29,20.5,29z M21,24v3.293L24.293,24H21z" fill="currentColor"/></g><g id="customer_survey_questionnaire_2_"><g><g><path d="M9.653,18.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,17.959,9.791,18.016,9.653,18.016z" fill="currentColor"/></g></g><g><g><path d="M9.653,13.016c-0.004,0-0.007,0-0.011,0c-0.142-0.003-0.276-0.066-0.368-0.174l-1.153-1.346       c-0.18-0.209-0.156-0.525,0.054-0.705c0.21-0.18,0.526-0.154,0.705,0.055l0.791,0.922l1.59-1.693       c0.189-0.201,0.505-0.211,0.707-0.021s0.211,0.506,0.022,0.707l-1.972,2.099C9.923,12.959,9.791,13.016,9.653,13.016z" fill="currentColor"/></g></g><g><g><path d="M17.5,23h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,23,17.5,23z" fill="currentColor"/></g></g><g><g><path d="M22.5,21h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,21,22.5,21z" fill="currentColor"/></g></g><g><g><path d="M22.5,16h-3c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h3c0.276,0,0.5,0.224,0.5,0.5       S22.776,16,22.5,16z" fill="currentColor"/></g></g><g><g><path d="M20.5,18h-7c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h7c0.276,0,0.5,0.224,0.5,0.5       S20.776,18,20.5,18z" fill="currentColor"/></g></g><g><g><path d="M17.5,16h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5       S17.776,16,17.5,16z" fill="currentColor"/></g></g><g><g><path d="M22.5,11h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5       S22.776,11,22.5,11z" fill="currentColor"/></g></g><g><g><path d="M18.5,13h-5c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h5c0.276,0,0.5,0.224,0.5,0.5       S18.776,13,18.5,13z" fill="currentColor"/></g></g><g><g><path d="M10.5,23h-2C8.224,23,8,22.776,8,22.5v-2C8,20.224,8.224,20,8.5,20h2c0.276,0,0.5,0.224,0.5,0.5v2       C11,22.776,10.776,23,10.5,23z M9,22h1v-1H9V22z" fill="currentColor"/></g></g></g></g><g><path d="M20.5,7h-9C11.224,7,11,6.776,11,6.5v-3C11,2.673,11.673,2,12.5,2C12.776,2,13,2.224,13,2.5    S12.776,3,12.5,3C12.224,3,12,3.225,12,3.5V6h8V3.5C20,3.225,19.776,3,19.5,3C19.224,3,19,2.776,19,2.5S19.224,2,19.5,2    C20.327,2,21,2.673,21,3.5v3C21,6.776,20.776,7,20.5,7z" fill="currentColor"/></g><g><path d="M17.5,3C17.224,3,17,2.776,17,2.5C17,2.225,16.776,2,16.5,2h-1c-0.108,0-0.211,0.033-0.296,0.097    C15.074,2.192,15,2.339,15,2.5C15,2.776,14.776,3,14.5,3S14,2.776,14,2.5c0-0.475,0.228-0.926,0.609-1.207    C14.867,1.102,15.176,1,15.5,1h1C17.327,1,18,1.673,18,2.5C18,2.776,17.776,3,17.5,3z" fill="currentColor"/></g></g></svg>--}}
{{--            <h3>عدد الطلبات</h3>--}}
{{--            <p> {{$order_count}}    طلب </p>--}}
{{--            <a href="{{route('orders')}}">عرض الطلبات</a>--}}
{{--        </div>--}}
{{--    </div>--}}
{{--</div>--}}

{{--<div class="col-xl-4 col-md-6">--}}
{{--    <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--brown">--}}
{{--        <div class="card-body px-2">--}}
{{--            <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="32px" height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32" id="Layer_1" version="1.1" xml:space="preserve"><g id="communication"><path d="M21.504,17c-0.056,0-0.112-0.01-0.167-0.029c-0.2-0.07-0.333-0.259-0.333-0.471V13h-5   c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h5.5c0.276,0,0.5,0.224,0.5,0.5v2.592l2.362-2.907   C24.461,12.067,24.604,12,24.754,12h4.75c0.275,0,0.5-0.225,0.5-0.5v-9c0-0.275-0.225-0.5-0.5-0.5h-25c-0.275,0-0.5,0.225-0.5,0.5   v9c0,0.275,0.225,0.5,0.5,0.5h1.5c0.276,0,0.5,0.224,0.5,0.5S6.28,13,6.004,13h-1.5c-0.827,0-1.5-0.673-1.5-1.5v-9   c0-0.827,0.673-1.5,1.5-1.5h25c0.827,0,1.5,0.673,1.5,1.5v9c0,0.827-0.673,1.5-1.5,1.5h-4.512l-3.101,3.815   C21.795,16.935,21.651,17,21.504,17z" fill="currentColor"/><g><g><path d="M18.644,17.674l-4.762-1.652l-0.295-2.355c-0.239,0.106-0.516,0.168-0.833,0.168     c-0.056,0-0.103-0.012-0.155-0.016l0.329,2.635c0.023,0.189,0.152,0.349,0.332,0.41l5.055,1.756     c0.9,0.314,1.689,1.427,1.689,2.381v4.493c0,0.276,0.224,0.5,0.5,0.5s0.5-0.224,0.5-0.5V21     C21.004,19.621,19.945,18.129,18.644,17.674z" fill="currentColor"/></g><g><path d="M1.504,25.993c-0.276,0-0.5-0.224-0.5-0.5V21c0-1.379,1.059-2.871,2.359-3.326l4.762-1.641l0.063-0.512     c0.034-0.274,0.289-0.465,0.559-0.434c0.273,0.034,0.468,0.284,0.434,0.559l-0.103,0.82c-0.023,0.189-0.153,0.348-0.333,0.41     l-5.054,1.742C2.793,18.934,2.004,20.047,2.004,21v4.493C2.004,25.77,1.78,25.993,1.504,25.993z" fill="currentColor"/></g><g><path d="M11.004,30.961c-0.083,0-0.167-0.021-0.242-0.063l-6.5-3.591c-0.16-0.089-0.259-0.257-0.258-0.44     l0.019-3.346c0.002-0.275,0.229-0.543,0.503-0.496c0.276,0.001,0.499,0.227,0.497,0.502l-0.017,3.049l6.007,3.319l5.991-3.06     v-3.313c0-0.276,0.224-0.5,0.5-0.5s0.5,0.224,0.5,0.5v3.619c0,0.188-0.105,0.36-0.272,0.445l-6.5,3.319     C11.16,30.943,11.082,30.961,11.004,30.961z" fill="currentColor"/></g><g><g><path d="M11.004,7c-0.943,0-1.68-0.172-2.131-0.317C8.609,6.598,8.465,6.316,8.549,6.054      C8.634,5.791,8.914,5.647,9.178,5.73C9.562,5.854,10.189,6,11.004,6c1.808,0,2.774-0.446,2.784-0.451      c0.248-0.115,0.547-0.014,0.666,0.236c0.118,0.248,0.016,0.545-0.232,0.664C14.176,6.473,13.063,7,11.004,7z" fill="currentColor"/></g><g><path d="M11.004,15c-2.779,0-4.192-2.344-4.201-6.969C6.801,6.857,6.926,5.168,8.029,4.063      C8.733,3.357,9.733,3,11.004,3s2.271,0.357,2.975,1.063c1.104,1.105,1.229,2.795,1.227,3.969C15.196,12.656,13.783,15,11.004,15      z M11.004,4c-1.009,0-1.75,0.252-2.267,0.769C8.105,5.401,7.8,6.469,7.803,8.029C7.811,12.047,8.857,14,11.004,14      s3.193-1.953,3.201-5.971c0.003-1.561-0.303-2.628-0.935-3.261C12.754,4.252,12.013,4,11.004,4z" fill="currentColor"/></g></g></g><path d="M22.504,9h-4c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h4c0.276,0,0.5,0.224,0.5,0.5S22.78,9,22.504,9z   " fill="currentColor"/><path d="M27.504,6h-9c-0.276,0-0.5-0.224-0.5-0.5s0.224-0.5,0.5-0.5h9c0.276,0,0.5,0.224,0.5,0.5S27.78,6,27.504,6z   " fill="currentColor"/></g></svg>--}}
{{--            <h3>عدد الرخص الصادرة</h3>--}}
{{--            <p>0 رخصة</p>--}}
{{--            <a href="#">عرض الرخص</a>--}}
{{--        </div>--}}
{{--    </div>--}}
{{--</div>--}}

{{--<div class="col-xl-4 col-md-6">--}}
{{--    <div class="card card-h-100 card-chart card-chart__filled card-chart__filled--lighbrown">--}}
{{--        <div class="card-body px-2">--}}
{{--            <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="32px" height="32px" viewBox="0 0 32 32" enable-background="new 0 0 32 32" id="_x3C_Layer_x3E_" version="1.1" xml:space="preserve"><g id="folder"><g><path d="M29.5,7h-18c-0.167,0-0.323-0.084-0.416-0.223L9.639,4.609C9.426,4.29,8.884,4,8.5,4h-5    C3.224,4,3,4.225,3,4.5v2C3,6.776,2.776,7,2.5,7S2,6.776,2,6.5v-2C2,3.673,2.673,3,3.5,3h5c0.723,0,1.571,0.453,1.971,1.055    L11.768,6H29.5C29.776,6,30,6.224,30,6.5S29.776,7,29.5,7z" fill="currentColor"/></g><g><g><path d="M29.5,30h-27C1.673,30,1,29.327,1,28.5v-19C1,8.673,1.673,8,2.5,8h27C30.327,8,31,8.673,31,9.5v19     C31,29.327,30.327,30,29.5,30z M2.5,9C2.224,9,2,9.225,2,9.5v19C2,28.775,2.224,29,2.5,29h27c0.276,0,0.5-0.225,0.5-0.5v-19     C30,9.225,29.776,9,29.5,9H2.5z" fill="currentColor"/></g></g><g><g><path d="M25.5,28h-24C1.224,28,1,27.776,1,27.5S1.224,27,1.5,27h24c0.276,0,0.5,0.224,0.5,0.5S25.776,28,25.5,28z     " fill="currentColor"/></g></g><g><g><path d="M13.5,13h-9C4.224,13,4,12.776,4,12.5S4.224,12,4.5,12h9c0.276,0,0.5,0.224,0.5,0.5S13.776,13,13.5,13z" fill="currentColor"/></g></g><g><g><path d="M9.5,15h-5C4.224,15,4,14.776,4,14.5S4.224,14,4.5,14h5c0.276,0,0.5,0.224,0.5,0.5S9.776,15,9.5,15z" fill="currentColor"/></g></g><g><circle cx="27.5" cy="27.5" fill="currentColor" r="0.5"/></g></g></svg>--}}
{{--            <h3>المخيمات تحت التنفيد</h3>--}}
{{--            <p>{{$not_complete_orders}}  مخيم </p>--}}
{{--            <a href="#">عرض المخيمات</a>--}}
{{--        </div>--}}
{{--    </div>--}}
{{--</div>--}}
