<div align="center">
    <b>الأعمال الإضافية</b>
</div>

<div>
    <table style='width: 100%;' cellspacing="0" cellpadding="0">
        <tbody >
        <tr>
            <td>أولا: متطلبات الأعمال الإضافية المقدمة من قبل شركات ومؤسسات حجاج الداخل والخارج</td>
        </tr>
        <tr>
            <td >
                <ol>
                    <li>
                        إنشاء دورات مياه عامة بحيث تتكون المجموعة الواحدة من أربع دورات أكثر ويتم إنشائة خارج المنطقة
                        المغطاه بالخيام قدر الإمكان و في حالة تعذر ذلك تنفذ تحت الخيام مع إزالة الأروقة الحالية لتلك الخيام
                        وأن يختصر إنشاء الدورات العامة على المواقع التي لا يوجد بها حمامات أما دورات المياه الخاصة فيجب أن
                        لا تقل عن دورتين متجاورتين وأن لا تتعارض مع مخارج الطوارئ ويتم ربط هذه الدورات بشبكة المياه و الصرف
                        الصحي حسب الادلة وفي كل الحالات تكون دورات المياه من الفيبر قلاس المقاوم .
                    </li>
                    <li>
                        إضافة مواضى لدورات المياه الخاصة بها .
                    </li>
                    <li>
                        عمل فواصل داخليه بين الخيام أو بين المواقع على أن تكون الفواصل من الألواح الجبسية المقاومة
                        للحريق صناعة شركة الجبس الأهلية بسماكة 12.7 سم أو الألواح الجبسية الفرنسية المقاومة للحريق أو
                        الألمانية المقاومة للحريق لمدة 45 دقيقة .
                    </li>
                    <li>
                        إنشاء مطابخ جديدة في المخيمات التي لا تتوفر فيها المطابخ على أن تكون مطابقة لمتطلبات الدفاع
                        المدني وحسب الادلة و الشروط .
                    </li>
                </ol>
            </td>
        </tr>
        <tr>
            <td>ثانياً : متطلبات تنفيذ العمل</td>
        </tr>
        <tr>
            <td>
                <ol>
                    <li>
                        يتم تنفيذ جميع الاعمال المطلوبة الورادة في الفقرة الأولى على حساب الجهة المستفيدة (الشركات
                        ومؤسسات حجاج الداخل و الخارج ) تحت إشراف مركز تسليم و التنسيق مع مقاولي التشغيل و الصيانة في المشروع
                        على مسءوليتهم .
                    </li>
                    <li>
                        عدم البدء بتنفيذ اي عمل من الأعمال المطلوبة إلا بعد الحصول على تصريح منمركز تسليم يبين نوع
                        العمل و موقعه و الاشتراطات الخاصة به ويلزم الإحتفاظ به بالموقع في مكان بارز مع مخطط معتمد يوضح
                        الأعمال الموافق على تنفيذها .
                    </li>
                    <li>
                        أن يتم الإتفاق مع مقاول التشغيل و الصيانة على القيام بعملية فك وحفظ و إعادة تركيب القواطع و
                        السواتر المطلوب وضع فواصل جبسية مكانها وفقا للأسعار المحددة منمركز تسليم وتسليمها لهم بمحاضر رسمية
                        وتكون تكلفة ذلك على حساب صاحب المخيم .
                    </li>
                    <li>
                        تقوم شركات ومؤسسات حجاج الداخل و الخاريج بالتنسيق مع اسكان الحجاج بمنى بإزالة كافة الأعمال
                        التي يجب إزالتها بعد موسم الحج مباشرة و إعادة الوضع إلى ما كان عليه سابقاً و تقديم ما يثبت ذلك من
                        الجهات المعنية .
                    </li>
                    <li>
                        تكليف مكتب هندسي إستشاري من قبل شركات ومؤسسات حجاج الداخل و الخارج يقوم بتقديم عدد ثلاثة
                        تقارير لكل موقع على ثلاثة مراحل أثناء تنفيذ العمل تفيد بمطابقة جميع الاعمال الإضافية للمطلوب أعلاه
                        من عدمه يتنفيذ هذه الشروط و الادلة و المواصفات الفنية وذلك لجميع الأعمال التخصصية .
                    </li>
                </ol>
            </td>
        </tr>
        </tbody>
    </table>

</div>
